#include <stdio.h>

int main(int argc, char const *argv[])
{
    // --------------- 算术运算符 ----------------
    // + - * / %

    printf("%d \n", 7 / 4);          // 1
    printf("%lf \n", (double)7 / 4); // 1.75000
    printf("%lf \n", 7.0 / 4);       // 1.75000

    printf("%d \n", 7 % 4); // 3

    // 模运算结果的正负性跟随运算符左边正负性
    printf("%d \n", 10 % 7);   // 3
    printf("%d \n", 10 % -7);  // 3
    printf("%d \n", -10 % 7);  // -3
    printf("%d \n", -10 % -7); // -3

    // a++
    // a--
    // ++a
    // --a

    // -------------------- 比较运算符 -----------------
    // 1 表示真， 0 表示假
    printf("%d \n", 4 == 3); // 0
    printf("%d \n", 4 > 3);  // 1
    // ==
    // !=
    // >
    // <
    // >=
    // <=

    // ------------------- 逻辑运算符 ------------------
    // &&:左右为真，结果为真，左边为假，右边不执行
    printf("%d \n", 1 && -1); // 1
    printf("%d \n", 1 && 0);  // 0

    // ||:只要有一边为真，结果就为真，左边为真右边不执行
    printf("%d \n", 1 || 0); // 1
    printf("%d \n", 0 || 0); // 0


    // ------------------ 条件运算符 ------------------

    int a = 5 ? 1 : 2;
    int b = 0 ? 1 : 2;
    printf("%d \n", a); // 1
    printf("%d \n", b); // 2

    return 0;
}
